# Cleaning the Mental Health Dataset
### Importing the Dataset:

In [284]:
library(tidyverse)
library(readxl)
library(dplyr)
library(glue)

Attaching package: ‘glue’


The following object is masked from ‘package:dplyr’:

    collapse

In [309]:
# Function to read excel sheets and extract columns & rows of Canterbury DHB for the years of 2004 - 2008
read_excel_mh <- function(file){
    path <- glue('Mental health data/{file}')
    colheads <- read_excel(path, sheet = 4, skip = 4) %>% names()
    colheads[2] <- 'Sex'
    
    year <- file %>%substr(6, 9) # Extract year from filename
    
    df <- read_excel(path, sheet = 4, skip =74, col_names = colheads) %>%
    slice(1:3) %>%
    mutate(Year = year, DHB = 'Canterbury') %>%
    select(DHB, Sex, Total, Year)
    
    return(df)
}

# Function to read excel sheets and extract columns & rows of Canterbury DHB for the year 2009-2010
read_excel_mh2 <- function(file){
    path <- glue('Mental health data/{file}')
    df <- read_excel(path, sheet = 12, col_names =c('DHB', 'Total', 'Rates')) %>%
    select(1:2) %>%
    slice(3:25) %>%
    filter(DHB == 'Canterbury') %>%
    mutate(Year = '2010')
        
    return(df)
}

# Function to read excel sheets and extract columns & rows of Canterbury DHB for the year 2010-2020
read_excel_mh3 <- function(file, sheetnum, slicefrom, sliceto){
    slicefrom <- slicefrom - 4
    sliceto <- sliceto - 4
    path <- glue('Mental health data/{file}')
    df <- read_excel(path, sheet = sheetnum, skip = 3) %>%
    select(1:3) %>%
    slice(slicefrom:sliceto)
    
    names(df) <- c('DHB', 'Sex', 'Total') # Rename columns
    year <- file %>%substr(6, 9) # Extract year from filename
    df <- df %>% mutate(DHB = 'Canterbury', Year = year)
    
    return(df)
}

In [296]:
mh_df_1920 <- read_excel_mh3("16 mh2020.xlsx", 11, 59, 61)
mh_df_1920
#read_excel("Mental health data/08 mh2012.xlsx", sheet = 15)

New names:
* `` -> ...1
* `` -> ...2
* `` -> ...3

  DHB        Sex    Total Year
1 Canterbury Total  13130 2020
2 Canterbury Male    6749 2020
3 Canterbury Female  6381 2020

In [310]:
# Read the columns of Canterbury DHB
mh_df_0405 <- read_excel_mh("01 mh2005.xls")
mh_df_0506 <- read_excel_mh("02 mh2006.xls")
mh_df_0607 <- read_excel_mh("03 mh2007.xls")
mh_df_0708 <- read_excel_mh("04 mh2008.xls")
# Year 0809 is missing
mh_df_0910 <- read_excel_mh2("06 mh2010.xls")
mh_df_1011 <- read_excel_mh3("07 mh2011.xlsx", 14, 29, 31)
mh_df_1112 <- read_excel_mh3("08 mh2012.xlsx", 15, 62, 64)
mh_df_1213 <- read_excel_mh3("09 mh2013.xlsx", 11, 68, 70)
mh_df_1314 <- read_excel_mh3("10 mh2014.xlsx", 11, 71, 73)
mh_df_1415 <- read_excel_mh3("11 mh2015.xlsx", 11, 71, 73)
mh_df_1516 <- read_excel_mh3("12 mh2016.xlsx", 11, 62, 64)
mh_df_1617 <- read_excel_mh3("13 mh2017.xlsx", 11, 68, 70)
mh_df_1718 <- read_excel_mh3("14 mh2018.xlsx", 11, 68, 70)
mh_df_1819 <- read_excel_mh3("15 mh2019.xlsx", 11, 68, 70)
mh_df_1920 <- read_excel_mh3("16 mh2020.xlsx", 11, 59, 61)

New names:
* `` -> ...1
* `` -> ...2

New names:
* `` -> ...1
* `` -> ...2

New names:
* `` -> ...1
* `` -> ...2

New names:
* `` -> ...1
* `` -> ...2

New names:
* `` -> ...1
* `` -> ...2
* `` -> ...3

New names:
* `` -> ...1
* `` -> ...2
* `` -> ...3

New names:
* `` -> ...1

New names:
* `` -> ...1

New names:
* `` -> ...1

New names:
* `` -> ...1

New names:
* `` -> ...1
* `` -> ...2
* `` -> ...3

New names:
* `` -> ...1
* `` -> ...2
* `` -> ...3

New names:
* `` -> ...3

New names:
* `` -> ...1
* `` -> ...2
* `` -> ...3

In [311]:
mh_df_0405
mh_df_0506
mh_df_0607
mh_df_0708
mh_df_0910 # odd one
mh_df_1011
mh_df_1112
mh_df_1213
mh_df_1314
mh_df_1415
mh_df_1516
mh_df_1617
mh_df_1718
mh_df_1819
mh_df_1920

  DHB        Sex    Total Year
1 Canterbury Total  10088 2005
2 Canterbury Male    5199 2005
3 Canterbury Female  4889 2005

  DHB        Sex    Total Year
1 Canterbury Total  10071 2006
2 Canterbury Male    5192 2006
3 Canterbury Female  4879 2006

  DHB        Sex    Total Year
1 Canterbury Total  9887  2007
2 Canterbury Male   5094  2007
3 Canterbury Female 4793  2007

  DHB        Sex    Total Year
1 Canterbury Total  9502  2008
2 Canterbury Male   4767  2008
3 Canterbury Female 4735  2008

  DHB        Total Year
1 Canterbury 11227 2010

  DHB        Sex    Total Year
1 Canterbury Total  11121 2011
2 Canterbury Male    5719 2011
3 Canterbury Female  5402 2011

  DHB        Sex    Total Year
1 Canterbury Total  12374 2012
2 Canterbury Male    6309 2012
3 Canterbury Female  6065 2012

  DHB        Sex    Total Year
1 Canterbury Total  12906 2013
2 Canterbury Male    6398 2013
3 Canterbury Female  6508 2013

  DHB        Sex    Total Year
1 Canterbury Total  13289 2014
2 Canterbury Male    6559 2014
3 Canterbury Female  6730 2014

  DHB        Sex    Total Year
1 Canterbury Total  13199 2015
2 Canterbury Male    6483 2015
3 Canterbury Female  6716 2015

  DHB        Sex    Total Year
1 Canterbury Total  14089 2016
2 Canterbury Male    7172 2016
3 Canterbury Female  6917 2016

  DHB        Sex    Total Year
1 Canterbury Total  12711 2017
2 Canterbury Male    6610 2017
3 Canterbury Female  6101 2017

  DHB        Sex    Total Year
1 Canterbury Total  12556 2018
2 Canterbury Male    6542 2018
3 Canterbury Female  6014 2018

  DHB        Sex    Total Year
1 Canterbury Total  13152 2019
2 Canterbury Male    6887 2019
3 Canterbury Female  6265 2019

  DHB        Sex    Total Year
1 Canterbury Total  13130 2020
2 Canterbury Male    6749 2020
3 Canterbury Female  6381 2020

In [315]:
# Bind the tables into one dataframe (except 2010 because it does not have information on breakdown numbers by sex)
mh_df <- mh_df_0405 %>% 
        rbind(mh_df_0506) %>%
        rbind(mh_df_0607) %>% 
        rbind(mh_df_0708) %>%
        rbind(mh_df_1011) %>%
        rbind(mh_df_1112) %>% 
        rbind(mh_df_1213) %>%
        rbind(mh_df_1314) %>%
        rbind(mh_df_1415) %>% 
        rbind(mh_df_1516) %>%
        rbind(mh_df_1617) %>%
        rbind(mh_df_1718) %>% 
        rbind(mh_df_1819) %>%
        rbind(mh_df_1920)
mh_df %>% head()

  DHB        Sex    Total Year
1 Canterbury Total  10088 2005
2 Canterbury Male    5199 2005
3 Canterbury Female  4889 2005
4 Canterbury Total  10071 2006
5 Canterbury Male    5192 2006
6 Canterbury Female  4879 2006